{"content":"# What is the anatomy of a STARK proof?\n\nThis was a question I had while analysing how to implement recursive proofing, otherwise known as a STARK verifier inside a provable environment.\n\n**Thank you to**: [Louis Guthmann](https://twitter.com/GuthL) for helping connect me and answering my early questions around STARK's and SNARK's, as well [Kobi Gurkan](https://twitter.com/kobigurk) (who [explained R1CS to me](https://twitter.com/liamzebedee/status/1542383265708793857)), [Th0rgal_](https://twitter.com/Th0rgal_) for volunteering to tutor me on the polynomial maths, Alan Szepieniec for his fantastic [public guide on STARK's](https://aszepieniec.github.io/stark-anatomy/overview).\n\n## Background.\n\nTurns out, STARK's are really simple! Here are some topics and concepts that will come up during your explorations. \n\n * constraint systems, satisfiability\n     * Fun question - how do you convert a program into a set of equations?\n * arithmetic and polynomial equations\n * the idea of a \"finite field\", field elements\n     * Fun question - how come Cairo requires a separate operator for greater-than/less-than comparisons?\n * basic interpolation, bonus pts. if you understand FFT\n * verifier-prover computation model, interactive vs. non-interactive protocols, Fiat-Shamir transform\n * commitment schemes - operations of (commit, open/reveal, verify/prove), merkle trees\n * degree of a polynomial, [unicity theorem](https://math.stackexchange.com/questions/240871/understanding-proof-of-uniqueness-in-theorem-on-polynomial-interpolation)\n * [FRI protocol](https://aszepieniec.github.io/stark-anatomy/fri.html), which is basically a [binary search](https://en.wikipedia.org/wiki/Binary_search_algorithm).\n\n### Simple analogies for common concepts.\n\n * [Commitment scheme](https://en.wikipedia.org/wiki/Commitment_scheme) - basically a generalisation of merkle trees. The merkle root is in essence, a commitment.\n * FRI is a [binary search](https://en.wikipedia.org/wiki/Binary_search_algorithm) for the polynomial to find an area where it fails the low-degreeness test.\n * [Fiat-Shamir](https://en.wikipedia.org/wiki/Fiat%E2%80%93Shamir_heuristic) - hashes make people (the prover) commit to things (same idea as atomic swaps), which prevents them from aborting a protocol (like a swap).\n * [Reed-Solomon](https://en.wikipedia.org/wiki/Reed%E2%80%93Solomon_error_correction) - this tech is usually used for [error correction](https://en.wikipedia.org/wiki/Error_correction_code) - ie. redundantly encode data, so if a bit flips / the cable does something wack, you can still recover the full data. \n   If you look at how Reed-Solomun works, it's just based on interpolating that data into a polynomial curve, and sampling points from it (redundancy). FRI just uses Reed-Solomun to sample random points for the binary search\n   \n## ZK-STARK's - how are they generated?\n\nThe **best** explanation I've ever read of ZK-STARK's is from a cryptographer named [Alan Szepieniec](https://twitter.com/aszepieniec), who has written [an entire public series here](https://aszepieniec.github.io/stark-anatomy/overview). The diagrams and content below in **this section** are mostly lifted from his writing. \n\nThese are the basic steps to generating a STARK proof from running a provable program:\n\n![](https://i.imgur.com/arAByNL.png)\n\n 1. **Arithmetization**. The first transformation in the pipeline is known as arithmetization. In this procedure, the sequence of elementary logical and arithmetical operations on strings of bits is transformed into a sequence of native finite field operations on finite field elements, such that the two represent the same computation. The output is an arithmetic constraint system, essentially a bunch of equations with coefficients and variables taking values from the finite field.\n\n 3. **Interpolation**. Interpolation in the usual sense means finding a polynomial that passes through a set of data points. In the context of the STARK compilation pipeline, interpolation means finding a representation of the arithmetic constraint system in terms of polynomials. The interpolation step reduces the satisfiability of an arithmetic constraint system to a claim about the low degree of certain polynomials - ie. from $x=0$ to $deg (f)$. The resulting object is an abstract protocol called a Polynomial Interactive oracle proof (IOP). \n\n 4. **Proving low-degreeness**. The protocol designer who wants to use a Polynomial IOP as an intermediate stage must find a way to commit to a polynomial and then open that polynomial in a point of the verifier’s choosing. FRI is a key component of a STARK proof that achieves this task by using Merkle trees of Reed-Solomon Codewords to prove the boundedness of a polynomial’s degree. After applying the Fiat-Shamir transform to make it non-interactive, you get a probabilistic proof that at least some high percentage (eg. 80%) of a given set of values represent the evaluations of some specific polynomial whose degree is much lower than the number of values given. This is the STARK.\n\n### How can proving low-degreeness be related to proving the satisfiability of the polynomial?\n\nThis is a question I had, and didn't know the answer to! So [we investigated](https://twitter.com/liamzebedee/status/1591785700327919617).\n\n**Problem**. How is the problem of arithmetic satisfiability converted into proving low-degreeness of a polynomial?\n\n**Answer**. Using the unicity theorem of polynomials + blowing up the domain to make it intractable to find a \"colliding\" polynomial. See [[1]](https://math.stackexchange.com/questions/240871/understanding-proof-of-uniqueness-in-theorem-on-polynomial-interpolation), [[2]](https://en.wikipedia.org/wiki/Polynomial_interpolation)\n\n> **Polynomial unicity theorem.**\n> There exists a unique polynomial of degree at most $n$ that interpolates the $n+1$ data points $(x_0,y_0),\\dotsc,(x_n,y_n) \\in \\mathbb {R} ^2$, where no two $x_j$ are the same.\n\nBasically:\n\n - polynomial has roots, where $f(x)=0$\n- there is a theorem which relates the roots of a polynomial with the [degree](https://en.wikipedia.org/wiki/Degree_of_a_polynomial)\n- this is the unicity theorem\n- if you can construct the unique polynomial of degree at most $n$, for these roots, then proving the existence of this polynomial (impossible) is equivalent to proving the low-degreeness of the polynomial (possible using FRI)\n- problem though - what stops me constructing a polynomial of a similar degree less than $n$, but with completely different values to those in the trace? \n- approach is to \"blow up\" the polynomial's domain, such that finding a 2nd \"exploit\" polynomial as described would be intractable according to some security assumptions. \n- this is called the **low-degree extension**. Quoting Starkware:\n\n> N. In order to achieve a secure protocol, each such polynomial is evaluated over a larger domain, which we call the evaluation domain. For example, in our StarkDEX Alpha the size of the evaluation domain is usually 16*N. We refer to this evaluation as the trace Low Degree Extension (LDE) and the ratio between the size of the evaluation domain and the trace domain as the blowup factor (those familiar with coding theory notation will notice that the blowup factor is 1/rate and the LDE is in fact simply a Reed-Solomon code of the trace).\n\n\n<!-- \n\ny = 1x + 2x - 1\nRoots of your polynomial. There is only 1 root\nwhere y=0\nroot := x, where f(x)=y=0\nyou can rewrite as:\n0/0 = (1x + 2x - 1) / (x - y)\n\nYou can always rewrite in the form\n(x - A)(x - B) ... for the roots (A, B, ...)\n(x - 1)(x - 2) - graph this on geogebra\n\nSo we can rewrite this relation\nB(x) = 0, when x=y\ny is a root of B(x)\nthus we can rewrite as \n(x - y) divides B(x)\n\nhttps://math.stackexchange.com/questions/240871/understanding-proof-of-uniqueness-in-theorem-on-polynomial-interpolation\n\n -->\n\n\n### Concepts.\n\n - **Execution Trace**. A series of registers over time.\n - **Constraints** / **Trace Polynomials** / **AIR constraints**. \n     - expressed as polynomials composed over the trace cells that are satisfied if and only if the computation is correct. \n     - aka _Algebraic Intermediate Representation (AIR) Polynomial Constraints_.\n     - Examples: \n         - transition constraints - program counter \n         - boundary constraints\n - **Composition polynomial**.\n     - A combination of the constraints into a single (larger) polynomial, so that a single low degree test can be used to attest to their low degree\n     - Only used in Starkware's STARK's (see ethstark)\n\n\n## ZK-STARK's - how are they verified?\n\nTo verify the validity of the execution trace:\n\n 1. Read the trace and constraint commitments. (reveal their leaf in the merkle tree)\n 2. Draw pseudo-random query positions for the LDE domain from the public coin\n 3. Read evaluations of trace and constraint composition polynomials at the queried positions;\n 4. For each queried trace/constraint state, combine column values into a single value by computing their random linear combinations. \n 5. [Combine trace and constraint compositions together](https://github.com/novifinancial/winterfell/blob/main/verifier/src/composer.rs#L179:12).\n 6. Compute evaluations of the DEEP composition polynomial at the queried positions.\n 7. Verify low-degree proof. Make sure that evaluations of the DEEP composition polynomial we computed in the previous step are in fact evaluations of a polynomial of degree equal to trace polynomial degree. This uses the positions from step (2).\n\nBasically:\n\n * The computation is expressed as both the trace and the constraints. Of course we cannot know the validity of the constraints without the trace values. We use a public coin to seed our selection of positions, and then read the commitments, evaluate the polynomials at those committed positions, combine their values into the composition polynomial, and then do our degree-ness test using FRI.\n\nThere is good docs in the [Winterfell verifier code](https://github.com/novifinancial/winterfell/blob/main/verifier/src/lib.rs#L182). And here's a [summary of the Winterfell verification](https://gist.github.com/liamzebedee/a5864ec950ab13f566f0104fe1711681).\n\n\n## Data structure for a STARK proof.\n\nThis section is WIP. Basically I want to document what a STARK proof looks like at the data level.\n\n\n### Circom.\n\nIf you look at an implementation of a STARK verifier (e.g. [in Circom](https://www.notion.so/Roadmap-e116a4bdccf5441c98f60f85dccaa3fa)), you can see the data structure:\n\n- Trace\n    - Commitment - root of the trace merkle tree\n    - Evaluations - trace polynomial evaluations at the query positions\n    - Query proofs - authentication paths of the aforementionned merkle tree at the query positions\n- Constraint (transition/boundary) merkle tree.\n    - Root - termed the “constraint commitment”.\n    - Evaluations - polynomial evaluations.\n    - Query proofs - merkle authentication paths to check consistency between the commitment and the queries at pseudo-random position\n- FRI.\n    - Commitments - the root of the evaluations merkle tree for each FRI layer\n    - Proofs - authentication paths of the aforementionned merkle tree at the query_positions for each FRI layer\n    - Queries - DEEP\n- Misc:\n    - OOD - out-of-domain - basically **boundary constraints**.\n    - pub_coin_seed - serialized public inputs and context to initialize the public coin\n    - pow_nonce - nonce for the proof of work determined by the grinding factor in the proof options\n\n### Starkware.\n\nWIP.\n\n```\nstruct StarkWitness {\n\t    traces_decommitment: TracesDecommitment*,\n\t    traces_witness: TracesWitness*,\n\t    composition_decommitment: TableDecommitment*,\n\t    composition_witness: TableCommitmentWitness*,\n\t    fri_witness: FriWitness*,\n\t}\n```\n\n[https://sourcegraph.com/github.com/starkware-libs/cairo-lang@master/-/blob/src/starkware/cairo/stark_verifier/core/table_commitment.cairo](https://sourcegraph.com/github.com/starkware-libs/cairo-lang@master/-/blob/src/starkware/cairo/stark_verifier/core/table_commitment.cairo)\n\n## Misc.\n\nhttps://hackmd.io/@vbuterin/snarks#Can-we-have-one-more-recap-please"}